In [1]:
import numpy as np
from pandas import Series, DataFrame
import pandas as pd

In [2]:
index = ['a','b', 'c', 'd', 'e']

s = Series(np.arange(5), index=index)
s

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [3]:
dates = pd.date_range('2012-07-16', '2012-07-21')
atemps = Series([101.5, 98, 95, 99, 100, 92], index=dates)

In [4]:
atemps

2012-07-16    101.5
2012-07-17     98.0
2012-07-18     95.0
2012-07-19     99.0
2012-07-20    100.0
2012-07-21     92.0
Freq: D, dtype: float64

In [5]:
idx = atemps.index[2]
print(atemps[idx])
print(idx)

95.0
2012-07-18 00:00:00

In [6]:
sdtemps = Series([73, 78, 43, 60, 52, 87,], index=dates)
temps = pd.DataFrame({'Austin' : atemps, 'San Diego': sdtemps})

In [7]:
temps['Diff'] = temps['Austin'] - temps['San Diego']

In [8]:
temps

            Austin  San Diego  Diff
2012-07-16   101.5         73  28.5
2012-07-17    98.0         78  20.0
2012-07-18    95.0         43  52.0
2012-07-19    99.0         60  39.0
2012-07-20   100.0         52  48.0
2012-07-21    92.0         87   5.0

In [9]:
temps.iloc[2]

Austin       95.0
San Diego    43.0
Diff         52.0
Name: 2012-07-18 00:00:00, dtype: float64

In [10]:
idx = temps.index[2]

In [11]:
idx

Timestamp('2012-07-18 00:00:00', freq='D')

In [17]:
temps - temps.mean()

              Austin  San Diego       Diff
2012-07-16  3.916667        7.5  -3.583333
2012-07-17  0.416667       12.5 -12.083333
2012-07-18 -2.583333      -22.5  19.916667
2012-07-19  1.416667       -5.5   6.916667
2012-07-20  2.416667      -13.5  15.916667
2012-07-21 -5.583333       21.5 -27.083333

In [19]:
temps.std()

Austin        3.498809
San Diego    16.694310
Diff         17.833723
dtype: float64

In [20]:
temps[temps.Austin > 100]

            Austin  San Diego  Diff
2012-07-16   101.5         73  28.5

In [21]:
temps.loc[temps.Austin > 100]

            Austin  San Diego  Diff
2012-07-16   101.5         73  28.5